interface AlphabetColors {
	[key: string]: string;
}

export const ALPHABET_COLORS: AlphabetColors = {
	A: '#FFCCCC', // Светло-красный
	B: '#FFFFCC', // Светло-желтый
	C: '#CCCCFF', // Светло-синий
	D: '#FFCC99', // Светло-оранжевый
	E: '#CCFFCC', // Светло-зеленый
	F: '#FFCCFF', // Светло-фиолетовый
	G: '#FFDAB9', // Персиковый
	H: '#B0E0E6', // Светло-голубой
	I: '#98FB98', // Светло-зеленовато-желтый
	J: '#87CEEB', // Светло-небесно-голубой
	K: '#D8BFD8', // Светло-пурпурный
	L: '#F0E68C', // Хаки
	M: '#E6E6FA', // Лавандовый
	N: '#F5DEB3', // Светло-песочный
	O: '#FFF0F5', // Лавандово-розовый
	P: '#FFDEAD', // Очень светлый коричневый
	Q: '#F5F5DC', // Бежевый
	R: '#FFE4B5', // Светлый персик
	S: '#F0F8FF', // Голубой
	T: '#E0FFFF', // Светло-голубой
	U: '#FFE4E1', // Розоватый
	V: '#FFFAF0', // Слоновая кость
	W: '#FFF5EE', // Чередующийся апельсиновый
	X: '#F5F5F5', // Светло-серый
	Y: '#FAFAD2', // Светло-желтоватый
	Z: '#F0FFF0', // Медовый
};
